# Для считывания данных в языке Python используется команда input().

#Рассмотрим следующую программу:

#print('Как тебя зовут?')
#name = input()
#print('Привет,', name)

# На вход программе подается строка текста – имя человека. Напишите программу, 
# которая выводит на экран приветствие в виде слова «Привет» (без кавычек), 
# после которого должна стоять запятая и пробел, а затем введенное имя.

#name = input()
#print('Привет,', name)

# На вход программе подается строка текста – название футбольной команды. 
# Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).

'''name = input()
print(name, '- чемпион!')'''

# Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, 
# каждую на отдельной строчке.

'''name1 = input()
name2 = input()
name3 = input()
print(name1)
print(name2)
print(name3)'''

# Напишите программу, которая считывает три строки по очереди, 
# а затем выводит их в обратной последовательности, каждую на отдельной строчке.

name1 = input()
name2 = input()
name3 = input()
print(name3)
print(name2)
print(name1)